In [3]:
import numpy as np 
import pandas as pd

DataFrames Basic Operations

In [4]:
df1 = pd.DataFrame({
    'A': [1, 2, 3,np.nan, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [5]:
df1

     A   B    C
0  1.0  10  100
1  2.0  20  200
2  3.0  30  300
3  NaN  40  400
4  5.0  50  500

In [6]:
df1.shape

(5, 3)

In [7]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 252.0 bytes

In [9]:
df1.describe()

              A          B           C
count  4.000000   5.000000    5.000000
mean   2.750000  30.000000  300.000000
std    1.707825  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    1.750000  20.000000  200.000000
50%    2.500000  30.000000  300.000000
75%    3.500000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [10]:
df1['A']+10

0    11.0
1    12.0
2    13.0
3     NaN
4    15.0
Name: A, dtype: float64

DataFrames Applying Functions

In [11]:
df1

     A   B    C
0  1.0  10  100
1  2.0  20  200
2  3.0  30  300
3  NaN  40  400
4  5.0  50  500

In [12]:
# def square(x):
#     return x**2

In [13]:
# df1['D'] = df1['B'].apply(square)

In [14]:
df1['D'] = df1['B'].apply(lambda x : x**2)

In [15]:
df1

     A   B    C     D
0  1.0  10  100   100
1  2.0  20  200   400
2  3.0  30  300   900
3  NaN  40  400  1600
4  5.0  50  500  2500